Section 01

In [6]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.head(5)

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2024-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2024-03-07  1338.0

In [10]:
cond=df["f5"]!=0
df2=df[cond]
df2

        id    age city    f1  f2    f3    f4         f5  subscribed    views
0     id01    2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16   6820.0
1     id02    9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12   2534.0
2     id03   27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16   7312.0
3     id04   75.0   서울   NaN   2   NaN  INFP  52.667078  2024-07-21    493.0
4     id05   24.0   서울  85.0   2   NaN  ISFJ  29.269869  2024-03-07   1338.0
..     ...    ...  ...   ...  ..   ...   ...        ...         ...      ...
97    id97  100.0   경기   NaN   0  gold  INFP  67.886373  2024-03-18   6687.0
98    id98   39.0   경기  58.0   2   NaN  INFP  98.429899  2024-10-02    865.0
99    id99    1.0   경기  47.0   0  gold  ESFJ  97.381034  2024-12-02   6090.0
100  id100   47.0   경기  53.0   0   vip  ESFP  33.308999  2024-02-21  15535.0
101   id68   35.0   경기  45.0   2  gold  ISFP  67.886373  2024-07-29   8599.0

[102 rows x 10 columns]

In [15]:
min = df["views"].min()
df2["views"]=df2["views"].fillna(min)

In [16]:
df2["views"].median()

5924.0

Section 02

In [18]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")
df.head(5)

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16  7312.0
3  id04  75.0   서울   NaN   2   NaN  INFP  52.667078  2024-07-21   493.0
4  id05  24.0   서울  85.0   2   NaN  ISFJ  29.269869  2024-03-07  1338.0

In [26]:
df2 = df["subscribed"].value_counts()
df3 = df["subscribed"].mode()[0]
pd.to_datetime(df3).day

17

Section 03

In [42]:
df = pd.read_csv("type1_data1.csv")

df.dropna(inplace=True)

df["new"]=df["views"]/df["f1"]

df.sort_values("new", ascending=False , inplace=True)
int(df.iloc[0,1])
# df.iloc[:1]["age"].values[0]

22

Section 04

In [16]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")
df['views']=df['views'].fillna(0)
df.head(10)

     id   age city     f1  f2      f3    f4         f5  subscribed    views
0  id01   2.0   서울    NaN   0    gold  ENFJ  91.297791  2024-07-16   6820.0
1  id02   9.0   서울   70.0   1     NaN  ENFJ  60.339826  2024-05-12   2534.0
2  id03  27.0   서울   61.0   1    gold  ISTJ  17.252986  2024-03-16   7312.0
3  id04  75.0   서울    NaN   2     NaN  INFP  52.667078  2024-07-21    493.0
4  id05  24.0   서울   85.0   2     NaN  ISFJ  29.269869  2024-03-07   1338.0
5  id06  22.0   서울   57.0   0     vip  INTP  20.129444  2024-09-12  21550.0
6  id07  36.3   서울   60.0   1     NaN  ISFJ   9.796378  2024-01-11     61.0
7  id08  38.0   서울  101.0   1  silver  INFJ  83.685380  2024-03-06   3260.0
8  id09   3.3   서울   35.0   2     NaN  ESFJ  17.252986  2024-03-21   2764.0
9  id10  95.0   서울   74.0   1    gold  ISFP  98.429899  2024-04-03   9992.0

In [25]:
val = df.iloc[9]['views']
df = df.sort_values(by='views', ascending=False)
df.iloc[0:10, 9] = val

df.iloc[:, 9].sum()

652812.0

Section 05

In [36]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

cond = df['f4'].str.contains("FJ")
df[cond]

a = df[cond]['f2'].mean()
round(a,2)

0.61

Section 06

In [41]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

cond = (df['f3'] == "gold") & (df['f2'] == 2)
df = df[cond]

round(df['f1'].var(),2)

235.43

Section 07

In [47]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df['age'] = df['age']+1
df.head(5)

age20 = (df['age']>= 20) & (df['age']< 30)
age30 = (df['age']>= 30) & (df['age']< 40)

print(df[age20]['views'].mean() - df[age30]['views'].mean())

263.13076923076915

Section 08

In [60]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df['subscribed'] = pd.to_datetime(df['subscribed'])
cond = (df['subscribed'].dt.month == 2) & (df['subscribed'].dt.year == 2024)

sum(df[cond]['f3']== "gold")

5

Section 09

In [63]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

cond1 = df['views'] <= 1000
df = df[cond1]

df['f4'].mode()[0]

'ISFJ'

Section 10

In [70]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.dropna(inplace=True)
df.head(3)

df= df.groupby('city').mean(numeric_only=True)
df.sort_values('f2', ascending=False, inplace=True)
df

            age         f1        f2         f5        views
city
서울    38.000000  60.142857  0.785714  41.122705  7369.142857
경기    48.704000  61.360000  0.760000  52.106731  8127.880000
부산    35.075000  65.875000  0.687500  38.638715  6945.437500
대구    49.773333  66.200000  0.666667  27.370166  6819.133333

Section 11

In [81]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.dropna(inplace=True)

df.shape[0]*0.7

df=df.iloc[0:49]

df['views'].quantile(0.75)-df['views'].quantile(0.25)

2771.0

Section 12

In [96]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df = df.dropna(subset=['f1'])

mode = df['f3'].mode()[0]
df['f3'] = df['f3'].fillna(mode)

cond = (df['f3']=='gold')
df[cond].shape[0]

63

Section 13

In [98]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

cond = df['f1'].isnull()
df_null = df[cond]
a = df_null['age'].mean()
round(a,2)

53.6

Section 14

In [102]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.drop_duplicates(inplace=True)
df['f3'] = df['f3'].fillna(0)
df['f3'] = df['f3'].replace('silver',1)
df['f3'] = df['f3'].replace('gold', 2)
df['f3'] = df['f3'].replace('vip', 3)

int(df['f3'].sum())

C:\Users\문지민\AppData\Local\Temp\ipykernel_22080\2976823772.py:8: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['f3'] = df['f3'].replace('vip', 3)

167

Section 15

In [118]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

cols = df.select_dtypes(exclude='object').columns
df= df[cols]
df = df.fillna(0)
df['add'] = df['age']+df['f1']+df['f2']+df['f5']+df['views']
cond = df['add']>3000
df = df[cond]
len(df)

88

Section 16

In [122]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

q3 = df['views'].quantile(0.75)
q1 = df['views'].quantile(0.25)

iqr = q3 - q1
iqr15 = iqr * 1.5

cond = (df['views'] < (q1 - iqr15)) | (df['views'] > (q3 + iqr15))
df = df[cond]

df['views'].sum()

77699.0

Section 17

In [134]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

# standard deviation of 'views'
a = df['views'].std()

cond1 = df['age'] <= 0  # smaller than or equal to 0
cond2 = df['age'] != round(df['age'], 0) # not integer values

df = df[~cond1 & ~cond2]
b = df['views'].std()

round(a+b, 2)

8297.31

Section 18

In [156]:
import pandas as pd
df = pd.read_csv("type1_data2.csv", index_col = 'year')
df

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
year,,,,,,,,,,,,,,,,,,,,,
2000,137,74,114,140,80,150,16,133,178,181,...,124,94,118,12,50,191,137,174,56,128
2001,176,87,64,110,128,16,8,4,123,87,...,59,22,3,108,17,104,101,161,156,43
2002,128,132,123,112,134,160,180,47,115,155,...,160,111,116,75,48,51,81,101,194,73
2003,78,45,26,50,177,119,47,72,163,125,...,163,88,52,79,192,83,5,75,196,119
2004,1,162,124,12,1,126,58,123,186,161,...,100,93,86,12,115,72,29,30,88,150

In [158]:
num = df.loc[2001] > df.loc[2001].mean()
num2 = df.loc[2003] < df.loc[2003].mean()

sum(num) + sum(num2)

202

Section 19

In [159]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

In [164]:
df = df.fillna(method="bfill")
df = df.groupby(['city', 'f2']).sum(numeric_only=True).reset_index()

df = df.sort_values(by="views", ascending=False)
df.head(4)

C:\Users\문지민\AppData\Local\Temp\ipykernel_22080\1191377163.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df = df.fillna(method="bfill")

  city  f2     age      f1           f5     views
0   경기   0  1192.9  1490.0  1425.236647  154066.0
3   대구   0   664.0   982.0   371.184620  100421.0
1   경기   1   997.0  1016.0   935.958628   91442.0
6   부산   0   525.0   691.0   395.272907   80460.0

Section 20

In [200]:
import pandas as pd
df = pd.read_csv("type1_data1.csv")

df.head(3)

     id   age city    f1  f2    f3    f4         f5  subscribed   views
0  id01   2.0   서울   NaN   0  gold  ENFJ  91.297791  2024-07-16  6820.0
1  id02   9.0   서울  70.0   1   NaN  ENFJ  60.339826  2024-05-12  2534.0
2  id03  27.0   서울  61.0   1  gold  ISTJ  17.252986  2024-03-16  7312.0

In [202]:
df['subscribed'] = pd.to_datetime(df['subscribed'])
df['month'] = df['subscribed'].dt.month

df = df.groupby('month').sum(numeric_only=True)
df = df.sort_values(by='views', ascending=True)
df

KeyError: 'subscribed'